<?php
// Heading
$_['heading_title'] = 'Яндекс.Маркет';

// Text
$_['text_feed'] = 'Каналы продвижения';
$_['text_success'] = 'Настройки модуля обновлены!';
$_['text_edit'] = 'Настройки Яндекс.Маркет';
$_['text_show_all'] = 'Развернуть всё';
$_['text_hide_all'] = 'Свернуть всё';

// Tab
$_['tab_category'] = 'Категории маркета';
$_['tab_delivery'] = 'Доставка (Общие условия)';
$_['tab_delivery_product'] = 'Доставка (Индивидуальные условия)';

// Entry
$_['entry_status'] = 'Статус:';
$_['entry_yml'] = 'Упрощённый yml:';
$_['entry_data_feed'] = 'Адрес:';
$_['entry_shopname'] = 'Название магазина:';
$_['entry_company'] = 'Компания:';
$_['entry_vendor'] = 'Производитель:';
$_['entry_model'] = 'Модель:';
$_['entry_category'] = 'Категории:';
$_['entry_country_of_origin'] = 'Атрибут, отвечающий за страну производства товара:';
$_['entry_color_option'] = 'Опции, отвечающие за цвет:';
$_['entry_size_option'] = 'Опции, отвечающие за размер:';
$_['entry_currency'] = 'Валюта предложений:';
$_['entry_in_stock'] = 'Статус &quot;В наличии&quot;:';
$_['entry_out_of_stock'] = 'Статус &quot;Нет в наличии&quot;:';
$_['entry_sales_notes'] = 'Sales notes:';
$_['entry_settings'] = 'Настройки:';
$_['entry_available'] = 'Экспортировать только товары которые есть в наличии';
$_['entry_additional_images'] = 'Экспорт дополнительных изображений товара';
$_['entry_delivery_common'] = 'Использовать поле общие условия доставки для всех товаров';
$_['entry_delivery_individual'] = 'Использовать поле индивидуальные условия доставки для всех товаров';
$_['entry_combination'] = 'Экспорт комбинаций товара';
$_['entry_features'] = 'Экспорт свойств товара';
$_['entry_dimensions'] = 'Отображать размеры товара (dimensions)';
$_['entry_allcurrencies'] = 'Выгружать все валюты? (Если нет, выгрузится только поумолчанию)';
$_['entry_store'] = 'Возможность купить в розничном магазине';
$_['entry_delivery'] = 'Возможность доставки соответствующего товара';
$_['entry_pickup'] = 'Возможность зарезервировать и забрать самостоятельно';
$_['entry_manufacturer_warranty'] = 'Все товары имеют официальную гарантию производителя';
$_['entry_cost'] = 'Стоимость доставки в рублях';
$_['entry_days'] = 'Срок доставки в рабочих днях';
$_['entry_order_before'] = 'Время оформления заказа, до наступления которого действуют указанные сроки и условия доставки';
$_['entry_category'] = 'Категории';
$_['entry_price'] = 'Цена';
$_['entry_price_from'] = 'От';
$_['entry_priority'] = 'Приоритет';

$_['entry_yandex_market_category'] = 'Категория предложения в дереве категорий Яндекс.Маркета';

// Button
$_['button_delivery_add'] = 'Добавить';

//Help
$_['help_shopname'] = 'Короткое название магазина (название, которое выводится в списке найденных на Яндекс.Маркете товаров. Не должно содержать более 20 символов).';
$_['help_company'] = 'Полное наименование компании, владеющей магазином. Не публикуется, используется для внутренней идентификации.';
$_['help_vendor'] = 'Наименование производителя в случае, если он не задан у товара';
$_['help_model'] = 'Можно использовать теги:<br/>{NAME} - название товара<br/>{CATEGORY} - категория товара<br/>{VENDOR} - производитель товара<br/>{DIMENSIONS} - размеры товара<br/>{ATTR_ID} - атрибут товара';
$_['help_category'] = 'Отметьте категории из которых надо экспортировать предложения для Яндекс.Маркета.';
$_['help_currency'] = 'Яндекс.Маркет принимает предложения в валюте RUR, RUB или UAH. Выберите валюту в которой будут передаваться предложения.';
$_['help_in_stock'] = 'При наличии на складе';
$_['help_out_of_stock'] = 'При остатке на складе 0';
$_['help_yandex_market'] = 'Тема на <a target="_blank" href="http://forum.ocshop.info/index.php?/files/file/40-yandexmarket-20/">Форуме</a>';
$_['help_size_unit'] = 'Размер должен быть числом, кроме размеров международной шкалы: XS, S, M, L, и т.д., для бюстгальтеров: AA, A, B, C и т.д.';
$_['help_sales_notes'] = 'Используйте элемент для указания следующей информации: минимальная сумма заказа, минимальная партия товара, необходимость предоплаты, варианты оплаты, условия акции';
$_['help_yandex_market_category'] = 'Будет присвоена всем категориям, для которых она не задана индивидуально';

// Error
$_['error_permission'] = 'У Вас нет прав для управления этим модулем!';
?>
