<?php
// Heading
$_['heading_title']      = 'Оплата банковской картой';
$_['text_title']         = 'Оплата банковской картой';

// Text
$_['text_payment']       = 'Платёж';
$_['text_success']       = 'Настройки успешно соханены!';
$_['button_save']        = 'Сохранить';
$_['button_cancel']      = 'Отмена';

// Entry
$_['terminal_key']       = 'Номер магазина (выдаётся банком):';
$_['secret_key']         = 'Секретный ключ (выдаётся банком):';
$_['currency']           = 'Валюта (по умолчанию рубли - 643)';
$_['payment_url']        = 'Адрес платёжного шлюза (выдаётся банком):';
$_['description']        = 'Описание платежа:';
$_['status']             = 'Статус:';

// Error
$_['error_permission']   = 'Ошибка! У Вас нет прав на редактирование данного раздела!';
$_['error_terminal_key'] = 'Введите номер магазина!';
$_['error_secret_key']   = 'Введите секретный ключ!';
$_['error_payment_url']  = 'Введите адрес платёжного шлюза!';
$_['error_currency']     = 'Введите валюту платежа!';

// Payment
$_['pay_button']         = 'Оплатить';

$_['text_message']    = '<p>Ошибка при оплате заказа!</p><p>Пожалуйста, направляйте в <a href="%s">Службу поддержки</a> любые ваши вопросы.</p><p>Зарегистрированным покупателям доступен просмотр состояния заказов и возможность просмотра истории прошлых покупок.</p><p>Спасибо за покупки в нашем интернет-магазине!</p>';

?>
