<?php
// Text
$_['text_signin']             = 'Войти / Зарегистрироваться';

$_['text_new_customer']       = 'Регистрация';
$_['text_returning']          = 'Авторизация';
$_['text_returning_customer'] = 'Я уже зарегистрирован';
$_['text_details']            = 'Ваши персональные данные';
$_['entry_email']             = 'Email';
$_['entry_name']              = 'Имя';
$_['entry_password']          = 'Пароль';
$_['entry_telephone']         = 'Телефон';
$_['text_forgotten']          = 'Забыли пароль?';
$_['text_agree']              = 'Отправляя данные, принимаю условия страницы <a href="%s" class="agree"><b>%s</b></a>';



//Button
$_['button_login']         = 'Войти';
$_['button_continue']      = 'Зарегистрироваться';

//Error
$_['error_name']           = 'Имя должно содержать от 1 до 32 символов!';
$_['error_email']          = 'E-Mail введён неправильно!';
$_['error_telephone']      = 'В телефоне должно быть от 3 до 32 цифр!';
$_['error_password']       = 'В пароле должно быть от 4 до 20 символов!';
$_['error_exists']         = 'Ошибка: Этот E-Mail уже зарегистрирован!';
$_['error_agree']          = 'Ошибка: Для регистрации вы должны быть согласны с документом %s!';
$_['error_warning']        = 'Ошибка: Пожалуйста, проверьте форму на ошибки!';
$_['error_approved']       = 'Ошибка: Необходимо подтвердить аккаунт перед авторизацией.';
$_['error_login']          = 'Ошибка: Неправильно заполнены поля E-Mail и/или пароль.';